{"modifications": {"colors": [{"colorname": "darkbrown", "RGB": [128, 0, 0]}, {"colorname": "blue", "RGB": [0, 51, 204]}, {"colorname": "black", "RGB": [0, 0, 0]}], "packages": ["xcolor", "tikz", "multicol", "titletoc", "ragged2e", "fancyhdr", "url", "verbatim", "float", "titlesec", "listings", "mathptmx", "adjustbox", "titlesec", "tabularx"]}, "coverpage": {"title": {"subject": {"topic": "Technical Seminar", "title": "EfficientNet: Rethinking Model Scaling for CNNs", "semester": "8th"}, "students": {"members": [{"Name": "Yash Vora", "USN": "1RN16CS123"}, {"Name": "", "USN": ""}, {"Name": "", "USN": ""}, {"Name": "", "USN": ""}]}, "teachers": {"members": [{"Name": "", "Designation": "", "Department": ""}, {"Name": "Mr. Devraju B.M.", "Designation": " Assistant Professor", "Department": "Dept. of CSE"}, {"Name": "", "Designation": "", "Department": ""}]}}, "certificate": {"members": [{"Name": "Mr. Devraju B.M.", "Designation": " Assistant Professor", "Department": "Dept. of CSE"}, {"Name": "Dr. G. T. Raju", "Designation": "Vice Principal", "Department": "Professor and HoD"}, {"Name": "Dr. M. K. Venkatesha", "Designation": "Principal", "Department": ""}]}, "acknowledgements": {"content": "Convolutional neural networks (CNNs) are commonly developed at a fixed resource cost, and then scaled up in order to achieve better accuracy when more resources are made available. For example, ResNet can be scaled up from ResNet-18 to ResNet-200 by increasing the number of layers, and recently, GPipe achieved 84.3% ImageNet top-1 accuracy by scaling up a baseline CNN by a factor of four. \r\n<BR>\r\nThe conventional practice for model scaling is to arbitrarily increase the CNN depth or width, or to use larger input image resolution for training and evaluation. While these methods do improve accuracy, they usually require tedious manual tuning, and still often yield suboptimal performance. \r\n<BR>\r\nWhat if, instead, we could find a more principled method to scale up a CNN to obtain better accuracy and efficiency?\r\n\r\n"}, "abstract": {"content": "Technology has become imperative in today’s day to day functioning of every possible sector in the society. One of the key contributions of technology has been optimization of human effort. In an attempt to utilize and develop a systematic information storage and retrieval system for one such domain, the idea of Leave Web Application originated. The main objective of the system is in helping the company retrieve most of the\r\ninformation about leave applied by employees.\r\n\r\n<BR>\r\n\r\nThe project leave web application includes employee login, manager login. Employee login enables employees to apply for leave. Employee can also view their leave status. Manager login enables the manager to either accept or reject the leave for subordinates. \r\n\r\n<BR>\r\n\r\nThe project implements the client-server based architecture model, in which the clients can request the server for various data that is processed and stored by the server module. The complete process in this application is based on three-tier architecture in which the client-server interaction is the front-end processing and database is the back-end tool.\r\n"}}, "chapters": [], "ref": [{"caption": "caption", "link": "link"}]}